<script>
	import bg from '../Assets/IMG/bg.png';
	import { mode, result, lang, name, response, roles } from '../stores';
</script>

<div
	style="
    background-image: url({bg});
    background-repeat: no-repeat;
    background-size: cover;
    background-position: center;
    "
	class="-z-50 fixed w-full h-[100dvh] space-y-5 flex flex-col justify-center items-center"
/>

<div class="relative w-full h-full flex flex-col items-center justify-center space-y-5">
	<div class="flex flex-col items-center justify-center space-y-2">
		<h1>{$lang === 'en' ? `${result.name} are` : `คุณ ${result.name} คือ`}</h1>
		<h1 class="text-3xl">{response.result}</h1>

        {#each roles as role}
            {#if role.role === response.result}
                <div class="flex flex-col items-center justify-center space-y-2">
                    <h1>{role.role}</h1>
                    <img src={role.detail.img} alt={role.role} class="w-40 h-40 tablet:w-60 tablet:h-60" />
                    <p>{$lang === 'en' ? role.detail.detailEN : role.detail.detailTH}</p>
                </div>
            {/if}
        {/each}
		
	</div>
    <div>
        <h1>หากคุณสนใจเทคโนโลยี</h1>
        <h1>และมีใจรักในการแบ่งปันความรู้</h1>
        <div>
            <h1>ไม่จำเป็นต้องเขียนโค๊ดเป็นก็ได้</h1>
        </div>

        <div>
            <h1>เข้ามาร่วมกับเรา</h1>
        </div>
        <h1>Click to Join Us</h1>
        <div class="">
            <div> picture </div>
            <div>
            <h1>
                Google Developer Student Clubs
            </h1>
            <h1>Thammasat University</h1>
        </div>
        </div>
        <div>
            <h1>หรือติดตามเราได้ที่</h1>
            <div class= "flex flex-row">
                <div> <svg width="47" height="46" viewBox="0 0 47 46" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M36.3873 45.119L10.4214 45.1429C4.70892 45.1479 0.0311635 40.641 0.024672 35.1264L4.32827e-06 10.0603C-0.00518885 4.54575 4.66348 0.0300836 10.376 0.0238171L36.3419 4.17829e-06C42.0544 -0.00500905 46.7321 4.50188 46.7386 10.0164L46.7633 35.0826C46.7698 40.5984 42.0998 45.114 36.3873 45.119Z" fill="url(#paint0_radial_166_2504)"/>
                    <path d="M23.382 31.3451C18.3719 31.3451 14.2939 27.4097 14.2939 22.572C14.2939 17.7342 18.3719 13.7988 23.382 13.7988C28.3921 13.7988 32.4701 17.7342 32.4701 22.572C32.4701 27.4097 28.3921 31.3451 23.382 31.3451ZM23.382 16.3054C19.8026 16.3054 16.8905 19.1166 16.8905 22.572C16.8905 26.0273 19.8026 28.8385 23.382 28.8385C26.9614 28.8385 29.8735 26.0273 29.8735 22.572C29.8735 19.1166 26.9614 16.3054 23.382 16.3054Z" fill="white"/>
                    <path d="M33.1193 15.0522C34.1949 15.0522 35.0668 14.2105 35.0668 13.1722C35.0668 12.134 34.1949 11.2923 33.1193 11.2923C32.0438 11.2923 31.1719 12.134 31.1719 13.1722C31.1719 14.2105 32.0438 15.0522 33.1193 15.0522Z" fill="white"/>
                    <path d="M31.1725 38.865H15.5929C10.5828 38.865 6.50488 34.9296 6.50488 30.0919V15.0522C6.50488 10.2144 10.5828 6.27905 15.5929 6.27905H31.1725C36.1826 6.27905 40.2605 10.2144 40.2605 15.0522V30.0919C40.2605 34.9296 36.1826 38.865 31.1725 38.865ZM15.5929 8.78567C12.0135 8.78567 9.10147 11.5968 9.10147 15.0522V30.0919C9.10147 33.5472 12.0135 36.3584 15.5929 36.3584H31.1725C34.7519 36.3584 37.664 33.5472 37.664 30.0919V15.0522C37.664 11.5968 34.7519 8.78567 31.1725 8.78567H15.5929Z" fill="white"/>
                    <defs>
                    <radialGradient id="paint0_radial_166_2504" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(17.3842 45.1754) scale(58.2921 56.2722)">
                    <stop stop-color="#FFDD55"/>
                    <stop offset="0.328" stop-color="#FF543F"/>
                    <stop offset="0.348" stop-color="#FC5245"/>
                    <stop offset="0.504" stop-color="#E64771"/>
                    <stop offset="0.643" stop-color="#D53E91"/>
                    <stop offset="0.761" stop-color="#CC39A4"/>
                    <stop offset="0.841" stop-color="#C837AB"/>
                    </radialGradient>
                    </defs>
                    </svg> </div>
                <h2>gdsc.tu</h2>
            </div>

            <div>
                <div class="flex flex-row">
                    <svg width="47" height="46" viewBox="0 0 47 46" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M40.9179 0H5.84541C2.62167 0 0 2.53082 0 5.64286V39.5C0 42.612 2.62167 45.1429 5.84541 45.1429H40.9179C44.1416 45.1429 46.7633 42.612 46.7633 39.5V5.64286C46.7633 2.53082 44.1416 0 40.9179 0Z" fill="#1976D2"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M39.4564 22.5714H32.1497V16.9286C32.1497 15.3712 33.459 15.5179 35.0724 15.5179H37.9951V8.46429H32.1497C29.8242 8.46429 27.594 9.35607 25.9497 10.9434C24.3053 12.5308 23.3815 14.6837 23.3815 16.9286V22.5714H17.5361V29.625H23.3815V45.1429H32.1497V29.625H36.5337L39.4564 22.5714Z" fill="#FAFAFA"/>
                        </svg>
                        
                     <div class="flex flex-col justify-center">
                <h1>Google Developer</h1>
                   <h1 class="items-center"> Student Club - TU</h1>
                </div>

            </div>
            </div>

            <div class="flex flex-row ">
                
                <div><svg width="47" height="46" viewBox="0 0 47 46" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M0 15.4776C0 10.0599 0 7.35108 1.09219 5.28181C2.05291 3.46162 3.58588 1.98177 5.47141 1.05434C7.61495 0 10.421 0 16.0331 0H30.7302C36.3423 0 39.1484 0 41.2918 1.05434C43.1774 1.98177 44.7104 3.46162 45.671 5.28181C46.7633 7.35108 46.7633 10.0599 46.7633 15.4776V29.6653C46.7633 35.0829 46.7633 37.7918 45.671 39.861C44.7104 41.6812 43.1774 43.1611 41.2918 44.0884C39.1484 45.1429 36.3423 45.1429 30.7302 45.1429H16.0331C10.421 45.1429 7.61495 45.1429 5.47141 44.0884C3.58588 43.1611 2.05291 41.6812 1.09219 39.861C0 37.7918 0 35.0829 0 29.6653V15.4776Z" fill="url(#paint0_linear_166_2498)"/>
                    <path d="M37.2021 12.941C34.674 10.8773 31.6403 9.84544 28.4378 9.67346L27.9323 10.1894C30.7975 10.8773 33.3256 12.2531 35.6853 14.1447C32.82 12.597 29.6176 11.5652 26.2468 11.2212C25.2355 11.0492 24.3928 11.0492 23.3815 11.0492C22.3703 11.0492 21.5275 11.0492 20.5163 11.2212C17.1455 11.5652 13.943 12.597 11.0778 14.1447C13.4375 12.2531 15.9656 10.8773 18.8308 10.1894L18.3253 9.67346C15.1228 9.84544 12.0891 10.8773 9.56094 12.941C6.69569 18.4441 5.1788 24.6351 5.01025 30.9981C7.53841 33.7496 11.0778 35.4694 14.7858 35.4694C14.7858 35.4694 15.9656 34.0937 16.8083 32.8898C14.6173 32.3739 12.5947 31.17 11.2464 29.2784C12.4262 29.9663 13.606 30.6541 14.7858 31.17C16.3028 31.858 17.8196 32.2018 19.3365 32.5459C20.6848 32.7178 22.0333 32.8898 23.3815 32.8898C24.7298 32.8898 26.0783 32.7178 27.4266 32.5459C28.9435 32.2018 30.4603 31.858 31.9773 31.17C33.1571 30.6541 34.3368 29.9663 35.5168 29.2784C34.1683 31.17 32.1458 32.3739 29.9548 32.8898C30.7975 34.0937 31.9773 35.4694 31.9773 35.4694C35.6853 35.4694 39.2246 33.7496 41.7528 30.9981C41.5843 24.6351 40.0674 18.4441 37.2021 12.941ZM17.8196 27.9026C16.1342 27.9026 14.6173 26.3549 14.6173 24.4631C14.6173 22.5714 16.1342 21.0237 17.8196 21.0237C19.505 21.0237 21.022 22.5714 21.022 24.4631C21.022 26.3549 19.505 27.9026 17.8196 27.9026ZM28.9435 27.9026C27.2581 27.9026 25.7411 26.3549 25.7411 24.4631C25.7411 22.5714 27.2581 21.0237 28.9435 21.0237C30.6288 21.0237 32.1458 22.5714 32.1458 24.4631C32.1458 26.3549 30.6288 27.9026 28.9435 27.9026Z" fill="white"/>
                    <defs>
                    <linearGradient id="paint0_linear_166_2498" x1="23.3816" y1="0" x2="23.3816" y2="45.1429" gradientUnits="userSpaceOnUse">
                    <stop stop-color="#687EC9"/>
                    <stop offset="1" stop-color="#5971C3"/>
                    </linearGradient>
                    </defs>
                    </svg>
                    </div>
                <h1 class="items-center">GDSC TU Community</h1>
            </div>
        </div>

        <div class="bg-MainWhite w-[200px] h-[200px] rounded-lg flex justify-center items-center">
            <h1 class="text-center">Thank you</h1>
        </div>

    </div>
</div>
